package com.anpay.sdk;
//规范命令字库
public class C_Cmd_pay {
	//系统数字命令字
	public static final int[] Type_int={0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60};
	//是否型命令字
	public static final String[] Type_yn={"y","n"};
	//日志类型
	public static final String[] Type_log={"js","java","sql","dao","io","file","request","login","do","other"};
	//全局路径变量(日志txt文件路径,学校静态资源路径)
	public static final String[] Add_src={"C:\\src_host\\system\\log\\log.txt","C:\\diancanyun_src\\"};
	//字符表(英文),切勿修改
	public static final String[] letter={"0","1","2","3","4","5","6","7","8","9",
			"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
			"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
			"`","~","!","@","#","$","%","^","&","*","(",")","-","_","=","+","\\","|",";",":","'","\"",",","<",".",">","/","?","*"};
	//字符表(英文),切勿修改
	public static final String[] letters={"0","1","2","3","4","5","6","7","8","9",
			"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
			"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"};
	//字符表(英文，去除肉眼障碍"I","l","c","C","o","O","p","P","s","S","u","v","w","x","U","V","W","X","z","Z"),切勿修改
	public static final String[] lettersNow={"0","1","2","3","4","5","6","7","8","9",
			"a","b","d","e","f","g","h","i","j","k","m","n","q","r","t","y",
			"A","B","D","E","F","G","H","J","K","L","M","N","Q","R","T","Y"};
	//skin:900694 您的点餐云账号@，初始登录密码为@，服务校验密码为@。请妥善保管。
	//skin:900695 您的本次短信验证码为：@，30分钟内有效且仅可使用一次。
	//skin:900784 请注意，当前服务系统（@）存在超时未处理的服务，请尽快处理！
	//skin:900785 您的管理账户：@，默认登录密码为@，请妥善保管！
}
